app/controllers/api/boards_controller.rb

  def index
    @boards = Board.all
---
SELECT "boards".* FROM "boards"

  def show
    @board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @board = Board.new(board_params)

    if @board.save
---
INSERT INTO "boards" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Third board"], ["created_at", "2019-10-28 09:07:27.696860"], ["updated_at", "2019-10-28 09:07:27.696860"]]